<template>
  <div class="task-formulation">
    <h3>Поле Link</h3>

    <p>
      Для разработки использовать компонент InputText, доступный по ссылке:
      <a href="https://v3.primevue.org/inputtext/">https://v3.primevue.org/inputtext/</a>
    </p>

    Поле предназначено для отображения ссылок на форме редактирования. Три состояния:
    <ul>
      <li>
        Поле не содержит значения: должно отображаться как обычный инпут с плейсхолдером “https://”
      </li>
      <li>
        Поле содержит значение: по-умолчанию отображается как web-link, только вместо URL отображает
        title страницы, на которую ссылается
      </li>
      <li>
        Ссылка редактируется: отображает URL, который был введен в поле при предыдущем
        редактировании.
      </li>
    </ul>

    Сценарий использования:
    <ul>
      <li>По-умолчанию поле содержит только плейсхолдер и не заполнено</li>
      <li>Пользователь вводит в поле URL</li>
      <li>
        После потери фокуса или по нажатию кнопки “Enter”, поле запрашивает title, на который
        ссылается:

        <ul>
          <li>Должен отобразиться title страницы (как web-link)</li>
          <li>Справа от title должна появиться иконка “карандаш” (редактирование)</li>
          <li>При нажатии на каранда происходит переход в режим редактирования линки</li>
        </ul>
      </li>
    </ul>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({
  name: 'FirstTaskFormulation',
});
</script>

<style scoped lang="scss"></style>
