<template>
  <div class="task-formulation">
    <h3>Многострочный текст в ячейке</h3>

    <p>Вы получили от API строку:</p>

    <p>
      [13:36:53] Расчетное время: 9 мин[13:36:58] Открыть клапан откачки К1[13:36:58] Включить
      вакуумный насос[13:36:58] Закрыть клапан К5[13:36:58] Закрыть клапан дистилляции К2[13:36:58]
      Ожидание: 8 с[13:37:06] Заливка 2.2мл. в испаритель[13:37:06] Заданно 26.50602409638554
      шагов[13:37:09] Заливка перекиси завершена[13:37:09] Открыть клапан дистилляции К2[13:42:09]
      Включить нагрев испарителя[13:42:09] Закрыть клапан дистилляции К2[13:42:09] конечное
      давление1.0960040758227925 торр[13:42:09] Выпаривание через К2[13:42:09] Выпаривание длилось5
      мин[13:42:09] Откачка до 1 торр[13:42:15] Закрыть клапан откачки К1[13:43:09] Открыть клапан
      откачки К1[13:43:14] Аппаратное смещение 0 денсит. = -0.313683180809021[13:43:14] Закрыть
      клапан дистилляции К2
    </p>

    <p>
      Необходимо, используя компонент
      <a href="https://v3.primevue.org/datatable/">https://v3.primevue.org/datatable/</a>
      , отобразить в одной из ячеек таблицы массив в следующем виде:
    </p>

    <p>
      [13:36:53] Расчетное время: 9 мин<br />
      [13:36:58] Открыть клапан откачки К1<br />
      [13:36:58] Включить вакуумный насос<br />
      [13:36:58] Закрыть клапан К5<br />
      [13:36:58] Закрыть клапан дистилляции К2<br />
      [13:36:58] Ожидание: 8 с<br />
      [13:37:06] Заливка 2.2мл. в испаритель<br />
      [13:37:06] Заданно 26.50602409638554 шагов<br />
      [13:37:09] Заливка перекиси завершена<br />
      [13:37:09] Открыть клапан дистилляции К2<br />
      [13:42:09] Включить нагрев испарителя<br />
      [13:42:09] Закрыть клапан дистилляции К2<br />
      [13:42:09] конечное давление1.0960040758227925 торр<br />
      [13:42:09] Выпаривание через К2<br />
      [13:42:09] Выпаривание длилось5 мин<br />
      [13:42:09] Откачка до 1 торр<br />
      [13:42:15] Закрыть клапан откачки К1<br />
      [13:43:09] Открыть клапан откачки К1<br />
      [13:43:14] Аппаратное смещение 0 денсит. = -0.313683180809021<br />
      [13:43:14] Закрыть клапан дистилляции К2<br />
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({
  name: 'FourthTaskFormulation',
});
</script>

<style scoped lang="scss"></style>
